Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/bootstrap.po
Languages: it

source: In here fields present in the ``bootstrap.ini`` configuration file are described.
it: Qui sono descritti i campi presenti nel file di configurazione ``bootstrap.ini``.

source: bootstrap section
it: Sezione bootstrap

source: This section contains settings used by the quick start tool.
it: Questa sezione contiene impostazioni usate dal tool di Quick Start.

source: The absolute path to the folder in which the tool will create the new instance root folder.
it: Il percorso assoluto della cartella dove il tool creerà le cartelle delle nuove istanze server.

source: Required
it: Richiesto

source: yes
it: sì

source: Type
it: Tipo

source: string
it: stringa

source: The absolute path to the folder containing the odksm ``run.py``.
it: Il percorso assoluto della cartella che contiene il file di ODKSM ``run.py``.

source: config, bat, ODKSM, mod_fix_settings sections
it: Sezioni config, bat, ODKSM, mod_fix_settings

source: All values in these section will be the default one present in the ``config.ini`` of a new instance. They are described in :doc:`the config.ini documentation<config>`.
it: Tutti i valori in queste sezioni saranno quelli presenti di default nei file ``config.ini`` in ogni nuova istanza server. Nella :doc:`documentazione del config.ini <config>` può essere trovata una descrizione di tutti i relativi campi.

source: Do not delete empty sections' titles from this file!
it: Non cancellare i titoli di sezioni vuote da questo file!
