Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/config.po
Languages: it

source: In here fields present in the ``config.ini`` configuration file are described.
it: Qui sono descritti i campi presenti nel file di configurazione ``config.ini``.

source: Required fields must be present in the config file but can be empty string!
it: I campi richiesti devono essere presenti nel file, ma possono essere stringe vuote!

source: config section
it: Sezione config

source: This section will populate the .cfg file that will be passed to the instance with the -config flag. The name of this specific file will be specified with :option:`server_config_file_name <bat server_config_file_name>`.
it: Questa sezione popolerà il file .cfg che verrà passato al server con il flag -config. Il nome di questo file specifico viene dall'opzione :option:`server_config_file_name <bat server_config_file_name>`.

source: The server instance name that will appear in game.
it: Il nome dell'istanza server che apparirà in game.

source: Required
it: Richiesto

source: yes
it: sì

source: Type
it: Tipo

source: string
it: stringa

source: The user password for accessing the server.
it: La password utente per accedere al server.

source: The password admins use to manage the server.
it: La password che gli admin usano per gestire il server.

source: Filename of pbo in ``MPMissions`` folder.
it: Il nome del file (senza estensione .pbo) della missione contenuta nella cartella ``MPMissions``.

source: Path of the custom template file for the cfg (more on :doc:`templates <templates>`).
it: Percorso del file template personalizzato per il file cfg (vedi :doc:`templates <templates>`).

source: bat section
it: Sezione bat

source: This section will populate the ``run_server.bat`` file that will be used to start the instance.
it: Questa sezione popolerà il file ``run_server.bat`` che verrà usato per avviare l'istanza server.

source: The server instance name that will appear in the monitoring tool.
it: Il nome dell'istanza server che apparirà nel tool di monitoring.

source: The port the server is running on.
it: La porta che occuperà il server.

source: string (**number**)
it: stringa (**numero**)

source: The max memory that the server will be able to allocate.
it: La memoria massima che il server potrà allocare.

source: The name of the *config* file, located in the instance folder.
it: Il nome del file *config*, nella cartella dell'istanza.

source: The name of the *cfg* file, located in the instance folder.
it: Il nome del file *cfg*, nella cartella dell'istanza.

source: Any addition flag to be passed to the server at run time.
it: Flag addizionali che verranno passati al server al momento del lancio.

source: Path of the custom template file for the bat (more on :doc:`templates <templates>`).
it: Percorso del file template personalizzato per il file bat (vedi :doc:`templates <templates>`).

source: ODKSM section
it: Sezione ODKSM

source: This section contains various settings required by the tool.
it: Questa sezione contiene varie impostazioni che riguardano direttamente il tool.

source: The name that will appear in the instance folder name.
it: Il nome che apparirà nella cartella dell'istanza server.

source: The path of a mod html preset generated by the Arma 3 launcher.
it: Il percorso del file preset di mod html generato dal launcher di Arma 3.

source: The list of the user mods.
it: La lista dei mod utente.

source: string (list of mod's names separated by a ``,``)
it: stringa (lista di nomi di mod separati da una ``,``)

source: The list of the server mods.
it: La lista dei mod lato server.

source: A user or server mod in this list will be copied instead of linked.
it: Un mod utente o lato server presente in questa lista verrà copiato invece che symlinkato.

source: Which key will be skipped and not linked to the main Keys folder.
it: Lista di chiavi che verranno ignorate e non linkate nella cartelle Keys di Arma.

source: The folder that contains the game.
it: La cartella che contiene il gioco.

source: Default Arma 3 installation path with Steam
it: percorso di installazione di default per Steam

source: Every instance folder will be put in this root folder.
it: Ogni cartella di istanza server verrà messa in questa cartella.

source: The name of the linked mod folder.
it: Il nome della cartella dei mod linkati.

source: The name of the copied mod folder.
it: Il nome della cartella dei mod copiati.

source: Every instance folder name will be prefixed by this.
it: Il nome di ogni cartella di istanza server inizierà con questo prefisso.

source: mod_fix_settings section
it: Sezione mod_fix_settings

source: These are settings required by specific :doc:`ModFix modules <modfix>`.
it: Queste sono impostazioni richieste da specifici :doc:`moduli ModFix <modfix>`.

source: To enable a modfix, remember that it's still a requirement to include that mod's name inside :option:`user_mods_list <ODKSM user_mods_list>`!
it: Per abilitare un modfix bisogna comunque ricordare di includere il nome di quel mod in :option:`user_mods_list <ODKSM user_mods_list>`!

source: If a modfix is enabled, some relative settings MAY be required. Specific information about currently implemented modfix can be found in the :doc:`modfix documentation <modfix_doc>`.
it: A seconda dei moduli abilitati, potrebbero essere richiesti campi addizionali. Informazioni più dettagliate sui singoli modfix possono essere trovati nella :doc:`relativa documentazione <modfix_doc>`.

source: All enabled fix file names (without the .py); will automatically put these mods in :option:`mods_to_be_copied <ODKSM mods_to_be_copied>` if needed.
it: I nomi dei file modfix (senza l'estensione .py) da abilitare; i relativi mod verranno automaticamente aggiunti alla lista :option:`mods_to_be_copied <ODKSM mods_to_be_copied>` se necessario.

source: string (list of fix's names separated by a ``,``)
it: stringa (lista di nomi di ModFix separati da una ``,``)
