Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: it

source: Basic Usage
it: Utilizzo Base

source: Advanced Usage
it: Utilizzo Avanzato

source: Documentation
it: Documentazione

source: Welcome!
it: Benvenuti!

source: This is the documentation for ODKSM, hosted on ReadTheDocs both in `english`_ and in `italian`_.
it: Questa è la documentazione per ODKSM, hostata su ReadTheDocs sia in `inglese`_ che in `italiano`_.

source: ODKSM_ is an open source python tool to quickly and easily create more than one Arma 3 server instance and manage their settings, mods and keys. It does so by intelligently using symlinks, which keeps server instances' folders small, easy to update and archive.
it: ODKSM_ è un tool open source scritto in python che permette di creare facilmente multiple istanze di server di Arma 3, e di mantenere le impostazioni, i mod e le chiavi. Riesce a fare tutto questo utilizzando intelligentemente symlink, il che mantiene le cartelle delle istanze piccole, facilmente aggiornabili e archiviabili.

source: It mainly caters to dedicated server maintainers, but could surely come in handy for mission makers.
it: Il tool è pensato principalmente per chi gestisce server dedicati, ma potrebbe tornare utile anche a chi sviluppa missioni.

source: Main features:
it: Caratteristiche principali:

source: Having separated server instances and mixing symlink with real configuration file result in a clean and organized Arma 3 main folder
it: Mantenere le istanze separate e utilizzare sia symlink che file di configurazione reali permette di mantenere la cartella principale di Arma pulita e organizzata

source: **ONE** easy to understand and thoroughly documented configuration file to manage the whole instance
it: **Un singolo** file di configurazione facile da interpretare e documentato a fondo permette di gestire l'intera istanza

source: Flexible .bat scripts to call the tool that can easily adapt to different folders structures
it: Gli script .bat che richiamano il tool sono flessibili e possono adattarsi facilmente a diverse strutture di cartelle

source: Simply running the tool is enough to keep mods, keys and Arma configuration files updated
it: Lanciare il tool è sufficiente per mantenere aggiornati mods, chiavi e file di configurazione

source: Quickstart tool to automate initial creation of multiple instances
it: Un Quickstart tool permette di automatizzare le fasi iniziali di creazione di multiple istanze

source: Modular architecture that allows to quickly implement mod specific behaviour
it: Una architettura modulare permette di implementare velocemente comportamenti specifici per singoli mod

source: Configuration file templates support
it: Supporto per template di file di configurazione
