Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/installation.po
Languages: it

source: Installation
it: Installazione

source: Prerequisites
it: Prerequisiti

source: The tool is currently compatible with Windows only (linux support is on its way).
it: Il tool è attualmente compatibile soltanto con Windows (stiamo lavorando al supporto per Linux).

source: The main requirement is Python 3.8 which can be installed via choco_ or the `official package`_.
it: La dipendenza principale è Python 3.8, che può essere installato tramite choco_ oppure tramite il `pacchetto ufficiale`_.

source: The quickest way to get the tool is to download the `latest release`_ from github and extract the zipped file.
it: Il modo più veloce per ottenere il tool è scaricare `l'ultima release`_ da Github ed estrarre i file compressi.

source: Alternatively, git_ can be used directly. This solution permits to more easily keep the tool updated. Once git is installed, run:
it: In alternativa, git_ può essere utilizzato direttamente. Questa soluzione permette di mantenere il tool aggiornato con più facilità. Una volta installato git, eseguire:

source: Install
it: Installazione

source: Usage of a `python virtual environment`_ is strongly encouraged: install pipenv and prepare the venv by issuing these commands inside the ODKSM root directory:
it: L'utilizzo di un `virtual environment python`_ è fortemente consigliato: installare pipenv e preparare il venv dando questi comandi dentro la root directory di ODKSM:

source: When the venv is ready, install ODKSM and its dependencies inside the venv with:
it: Quando il venv è pronto, installare ODKSM e le sue dipendenze dentro il venv con:

source: If the tool has been installed from the zipped release, the latest one must be downloaded and the extracted files must replace the old ones.
it: Se è stata usata la release zippata, va scaricata la release più recente e il contenuto estratto deve andare a sostituire la vecchia cartella di installazione del tool.

source: Do not simply overwrite the tool installation folder. Delete the old one and replace it with the new one. This will make sure no old files are left lingering.
it: Non sovrascrivere direttamente la cartella di installazione del tool: cancellare quella vecchia e rimpiazzala con quella nuova. Questo farà sì che non rimanga nessun vecchio file.

source: If git has been used instead, it can be used to keep the tool updated by running in its root directory:
it: Se invece è stato usato git, si può mantenere il tool aggiornato dando come comando nella cartella del tool:

source: This will keep the tool on the stable ``master`` branch, while active development happens on ``testing``.
it: Questo manterrà il tool sul branch stabile ``master``, mentre lo sviluppo attivo procede sul branch ``testing``.

source: The installation directory must be *clean* to update it this way. If something has been changed there, backup any important changes, run ``git reset --hard HEAD`` to reset the tool to its original state, then update it!
it: La cartella di installazione dovrà rimanere *pulita* per aggiornare in questo modo. Se qualcosa lì dentro è stato cambiato, fare un backup di qualsiasi modifica importante, eseguire ``git reset --hard HEAD`` per resettare il tool al suo stato originale e a quel punto aggiornalo con git!

source: Independently from the update method, any ``ODKSM.bat`` or ``START.bat`` that has been copied around will need to be manually updated to the current version, if they have changed with the newest release.
it: Indipendentemente dal sistema di aggiornamento scelto, qualsiasi ``ODKSM.bat`` o ``START.bat`` copiati fuori dalla cartella di installazione del tool avranno bisogno di essere rimpiazzati manualmente con le versioni aggiornate nel caso siano stati cambiati dall'update.

source: Verify the installation
it: Verifica l'installazione

source: To verify that ODKSM is working as intended and all dependencies are met run its test suite with:
it: Per verificare che ODKSM stia funzionando correttamente e che tutte le dipendenze siano soddisfatte, eseguire la test suite con:

source: All tests should pass! You are now ready to :doc:`create your first Instance <usage>`.
it: Tutti i test dovrebbero passare! Siamo pronti ora per :doc:`creare la prima istanza <usage>`.
