Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/modfix.po
Languages: it

source: Mod Specific Behavior
it: Azioni specifiche per mod

source: ODKSM modular architecture makes it easy to implement mod specific behaviour, like pasting a custom configuration file in the right folder after a mod has been installed or fetch an unusually placed mod's key. This is done through ModFixes, plug&play python modules.
it: L'architettura modulare di ODKSM rende facile implementare dei comportamenti specifici necessari a singoli mod, come ad esempio spostare un file di configurazione nella cartella giusta dopo aver installato un mod oppure linkare correttamente delle chiavi in posizioni inusuali. Questo viene realizzato tramite dei ModFix, dei moduli python plug&play.

source: Usage
it: Utilizzo

source: Enabling a ModFix is easy enough: just put its name in the list value of :option:`enabled_fixes <mod_fix_settings enabled_fixes>`.
it: Abilitare un ModFix è semplice: basta inserirne il nome nella lista :option:`enabled_fixes <mod_fix_settings enabled_fixes>`.

source: The *name* of a ModFix is the name of its module file (without the ``.py`` extension), which can be found inside the ``odk_servermanager\modfix`` folder (here it is, on github_).
it: Il *nome* di un ModFix è il nome del file del modulo (senza l'estensione ``.py``), che può essere trovato nella cartella ``odk_servermanager\modfix`` (eccola, su github_).

source: At this point, depending on the modfix, additional fields and their relative values may be needed inside the ``mod_fix_settings`` section. In :doc:`this page <modfix_doc>` currently implemented modfix are thoroughly documented.
it: A questo punto, a seconda del modfix, potrebbero essere necessario aggiungere altri campi con i relativi valori nella sezione ``mod_fix_settings``. In :doc:`questa pagina <modfix_doc>` si può trovare la documentazione riguardante i modfix attualmente implementati.

source: Take a moment to notice the difference between linked and copied mods.
it: È importante notare la differenza tra mod copiati e linkati.

source: Usually, mods without a modfix get simply linked inside the :option:`linked_mod_folder_name <ODKSM linked_mod_folder_name>` folder. Mod folders inside this linked mod one are *symlinks* pointing to the relevant mod folder, which means that files inside those mod folders are the original ones: these files are managed directly by Steam and should never be touched by an user or a modfix. This is the same behavior of the ``!Workshop`` folder, inside the main Arma 3 installation one.
it: Normalmente, mod non collegati con un modfix vengono semplicemente linkati dentro la cartella :option:`linked_mod_folder_name <ODKSM linked_mod_folder_name>`; le cartelle di mod qui presenti, sono *symlink* che puntano alle relative cartelle mod, il che significa che il contenuto di queste cartelle di mod è quello originale: questi file sono gestiti direttametne da Steam e non dovrebbero essere toccati né da un utente né da un modfix. Questo è lo stesso comportamento che adotta la cartella ``!Workshop``, dentro la cartella principale di Arma 3.

source: When a change is needed inside a mod folder, the modfix should **copy** the mod folder with all its files to the :option:`copied_mod_folder_name <ODKSM copied_mod_folder_name>` folder. Files inside this folder are safe to edit and server instance specific.
it: Quando è necessario operare cambiamenti all'interno di una cartella di un mod, il modfix dovrà invece **copiare** la cartella del mod con tutto il suo contenuto nella cartella :option:`copied_mod_folder_name <ODKSM copied_mod_folder_name>`. File e cartelle dentro quest'ultima possono essere modificati tranquillamente e sono distinti in ogni singola istanza.

source: This behavior can be forced by putting a mod's name inside the :option:`mods_to_be_copied <ODKSM mods_to_be_copied>`.
it: Questo comportamento può essere forzato inserendo il nome di un mod nella lista :option:`mods_to_be_copied <ODKSM mods_to_be_copied>`.

source: When handling copied mods, the modfix should also take care of updating said mod copy inside a server instance when needed. Depending on the specific mod structure and/or on the ModFix, the tool behavior when updating a copied mod could change. Be sure to backup any important file changed inside the copied mod folder before updating its instance the first time, just in case.
it: Quando hanno a che fare con mod *copiati*, i modfix devono anche occuparsi di aggiornare la copia del mod dentro l'istanza server quando necessario. A seconda della struttura del mod e/o del modfix, il comportamento del tool al momento di aggiornare un mod copiato potrebbe cambiare. Assicurarsi di fare un backup di ogni file modificato manualmente dentro la cartella del mod copiato prima di aggiornare l'istanza server la prima volta, per sicurezza.

source: Implement a ModFix
it: Implementare un ModFix

source: It's relatively easy to implement a ModFix. Some example can be found inside the modfix folder.
it: È relativamente facile implementare un ModFix. Alcuni esempi possono essere trovati nella cartella dei modfix.

source: First of all create a new python file inside the ``odk_servermanager\modfix`` folder. The file name will be the name of the ModFix you need to add to the :option:`enabled_fixes <mod_fix_settings enabled_fixes>`. For example, the file ``my_modfix.py`` will result in a ModFix called ``my_modfix``.
it: Prima di tutto creare un file python dentro la cartella ``odk_servermanager\modfix``. Il nome del file sarà il nome del ModFix che dovrà essere aggiunto a :option:`enabled_fixes <mod_fix_settings enabled_fixes>`. Ad esempio il file ``my_modfix.py`` risulterà in un ModFix chiamato ``my_modfix``.

source: Inside that file, extend the ``odk_servermanager.modfix.ModFix`` class. For example:
it: Dentro questo file, estendete la classe ``odk_servermanager.modfix.ModFix``. Ad esempio:

source: The ``name`` class field is required: by default the modfix will use that field to check if a modfix is to be applied to a specific mod. In this case, if the mod called ``my_mod`` is to be loaded (and the ``my_modfix`` is enabled!) this ModFix will be triggered.
it: Il campo di classe ``name`` è obbligatorio: di default il modfix cercherà di usare quel campo per controllare se il modfix va applicato ad un mod. In questo caso, quando il mod chiamato ``my_mod`` verrà caricato (e il modfix chiamato ``my_modfix`` sarà abilitato!) il tool applicherà questo modfix.

source: If a different pair mechanism between ModFix and mod is desired, the ``ModFix.does_apply_to_mod()`` method can be overridden. It may also be necessary to override ``ModFix.update_mods_to_be_copied_list()``, which takes care of automatically adding mods name to the :option:`mods_to_be_copied <ODKSM mods_to_be_copied>` list when needed.
it: Se si desidera collegare modfix a mod in maniera diversa, si può fare override del metodo ``ModFix.does_apply_to_mod()``. Potrebbe anche essere necessario fare override del metodo ``ModFix.update_mods_to_be_copied_list()``, che si occupa di aggiungere automaticamente il mod alla lista :option:`mods_to_be_copied <ODKSM mods_to_be_copied>` se necessario.

source: In the MyModFix module namespace (after and outside the newly created class) save a MyModFix object in a variable called ``to_be_registered``, like this:
it: Nel namespace del modulo MyModFix (dopo, all'esterno della neo creata classe) salvare un oggetto MyModFix in una variabile chiamata ``to_be_registered`` in questo modo:

source: This is required by the ModFix loading mechanism.
it: Questo passaggio è richiesto dal meccanismo di caricamento modfix.

source: MyModFix will now be loaded by the tool, but is currently doing nothing. Enter **ModFix hooks**. These are ModFix methods that the MyModFix class inherited and that by default are set to ``None``. Override the hook (or hooks!) that best cover this modfix needs and implement there the mod specific behavior. More information on hooks can be found in the next section.
it: Così facendo MyModFix verrà caricato, ma attualmente non farebbe nulla di utile. Introduciamo quindi gli **hook modfix**. Si tratta di metodi ereditati dalla classe ModFix e che sono impostati di default a ``None``. È quindi necessario fare l'override del (o degli!) hook che meglio ricoprono le necessità del modfix e implementare lì le azioni specifiche di cui ha bisogno il mod. Più informazioni sugli hook possono essere trovate nella prossima sezione.

source: Remember to implement behaviors both for the instance *init* and *update* *stages*. More on this later!
it: Ricordarsi di implementare entrambi gli *stage*: *init* e *update*.

source: It's a good idea to implement a proper test suite for MyModFix. Tests goes into the ``tests\modfixes`` folder, where you can also find several test examples.
it: È una buona idea implementare una test suite per MyModFix. I test vanno dentro la cartella ``tests\modfixes``, dove si trovano anche diversi esempi di test.

source: ModFixes&#39; Hooks
it: Hook dei ModFix

source: This is an example of a modfix hook:
it: Ecco un esempio di un hook:

source: Let's start by going over its arguments:
it: Questo è un hook che RIMPIAZZA l'operazione di default di COPIA del mod durante lo stage di INIT. |br| |br| Cominciamo con l'analizzarne gli argomenti:

source: This is the object representing the current server instance. It's an instance of the ``odk_servermanager.instance.ServerInstance`` class. It can be used to modify or to obtain information about the current server instance. Of particular interest is the ``server_instance.S`` object, which is a ``odk_servermanager.settings.ServerInstanceSettings`` instance, containing all settings currently valid for this server instance.
it: Questo oggetto rappresenta l'istanza server attuale. È un oggetto della classe ``odk_servermanager.instance.ServerInstance``. Può essere usato per modificare od ottenere informazioni riguardo l'istanza. Di particolare interesse è l'oggetto ``server_instance.S``, un'istanza della classe ``odk_servermanager.settings.ServerInstanceSettings``, che contiene tutte le impostazioni valida al momento nell'istanza.

source: This is seldomly needed. It's a list containing, in order, the current *stage*, the current *operation*, and the Mod name.
it: Questo viene raramente utilizzato. Si tratta di una lista che contiene, in ordine, lo *stage* attuale, l'attuale *operazione* e il nome del Mod.

source: There are currently 12 hooks that can be overridden. Their name is a combination of three elements:
it: Attualmente è possibile fare l'override di 12 hook. I loro nomi sono una combinazione di tre elementi:

source: All hooks in this *stage* get triggered when first creating the server instance.
it: Tutti gli hook in questo *stage* vengono attivati durante la prima volta che un tool viene eseguito per una istanza server.

source: All hooks in this *stage* get triggered when the server instance folder is already present and the tool is activated.
it: Tutti gli hook in questo *stage* vengono attivati quando la cartella dell'istanza server è già presente e il tool viene attivato.

source: These hooks activate if the mod is copied.
it: Questi hook si attivano se il mod è copiato.

source: These hooks activate if the mod is symlinked.
it: Questi hook si attivano se il mod è linkato.

source: These hooks activate before its designed *operation*. The default *operation* still takes place.
it: Questi hook si attivano prima della *operation* designata. La *operation* di default viene comunque eseguita.

source: These hooks activate after its designed *operation*. The default *operation* still takes place.
it: Questi hook si attivano dopo della *operation* designata. La *operation* di default viene comunque eseguita.

source: These hooks replace the default *operation*. Pre and Post hooks can still be called around replace hooks.
it: Questi hook rimpiazzato la *operation* di default. Pre e Post hook possono comunque venir chiamati intorno a questo hook replace.

source: If a replace hook that activates and does exactly nothing is needed (for example to prevent a regular copy update), override the hook ``hook_update_copy_replace`` and have it do nothing with a ``pass`` instruction like this:
it: Se si ha bisogno di un hook che rimpiazzi una *operation* senza far nulla (ad esempio per evitare che avvenga l'update di default di un mod copiato), fare l'override dell'hook ``hook_update_copy_replace`` e inserire soltanto l'istruzione ``pass`` per non fargli far nulla, in questo modo:
