Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/quick_start.po
Languages: it

source: Quick Start Tool
it: Tool di Quick Start

source: This tool aims to automate all actions taken at the very beginning of a new server instance creation.
it: Questo tool mira ad automatizzare le azioni necessarie all'inizio della creazione di una nuova istanza server.

source: First of all, make sure that ODKSM is installed and that you know how to configure a new instance.
it: Prima di tutto, accertarsi che ODKSM sia installato e di sapere come configurare una nuova istanza.

source: Begin with choosing a folder that will be the root of all server instances. Copy there both ``START.bat`` and ``bootstrap.ini``, that can be found in the ODKSM root folder.
it: Iniziare scegliendo la cartella che conterrà tutte le istanze server create. Copiare lì ``START.bat`` e ``bootstrap.ini``: entrambi possono essere trovati nella cartella principale di ODKSM.

source: Now edit ``bootstrap.ini`` and set the two fields in the ``[bootstrap]`` section:
it: Ora aprire ``bootstrap.ini`` e settare qui i due campi nella sezione ``[bootstrap]``:

source: :option:`instances_root <bootstrap instances_root>`: the directory in which the instances will be saved
it: :option:`instances_root <bootstrap instances_root>`: la cartella in cui le istanze server verranno salvate

source: :option:`odksm_folder_path <bootstrap odksm_folder_path>`: the root of ODKSM
it: :option:`odksm_folder_path <bootstrap odksm_folder_path>`: la cartella principale di ODKSM

source: Additional fields can be set in ``bootstrap.ini``: these will be default values in newly created instances' ``config.ini``, so it makes sense to set them here only if they are global values for the whole server, like maybe :option:`arma_folder <ODKSM arma_folder>` or :option:`password_admin <config password_admin>`.
it: Dentro ``bootstrap.ini`` possono essere settati molti altri campi: questi saranno impostati come valori di default nelle nuove istanze create dal tool, quindi ha senso settarli qui soltanto nel caso siano valori globali per l'intero server, come ad esempio :option:`arma_folder <ODKSM arma_folder>` o :option:`password_admin <config password_admin>`.

source: Finally, edit ``START.bat`` and set the variable ``ODKSM_FOLDER_PATH`` to your ODKSM root.
it: Infine, aprire ``START.bat`` e inserire il percorso della cartella principale di ODKSM nella variabile ``ODKSM_FOLDER_PATH``.

source: When keeping ``bootstrap.ini`` and ``START.bat`` in different folders, edit the latter and set the variable ``DEFAULT_CONFIG`` to the path of ``bootstrap.ini``.
it: Nel caso ``bootstrap.ini`` e ``START.bat`` vengano tenuti in due cartelle diverse, aprire quest'ultimo e impostare la variabile ``DEFAULT_CONFIG`` sul percorso del ``bootstrap.ini``.

source: Usage
it: Utilizzo

source: Simply launch the ``START.bat`` script. A console ui will ask for the instance name and whether to include :doc:`templates <templates>`.
it: Lanciare lo script ``START.bat``. Una interfaccia da console chiederà il nome dell'istanza e se includere dei :doc:`templates <templates>`.

source: You are **not** done! The tool just created a new folder, where it put everything needed to start configuring the server instance as explained in :ref:`usage:Create a server instance`.
it: Questo **non** è sufficiente per far partire l'istanza! Il tool ha soltanto creato la nuova cartella, dove ha generato tutto il necessario per iniziare la configurazione di una nuova istanza server come spiegato in :ref:`Creare una istanza server <usage:Create a server instance>`.
