Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/templates.po
Languages: it

source: Template Files
it: Templates

source: ODKSM compiles the Arma config file and the server startup script starting from templates that can be found in ``odk_servermanager\templates``.
it: ODKSM compila il file di configurazione di Arma e lo script di startup dell'istanza partendo da dei template che possono essere trovati dentro ``odk_servermanager\templates``.

source: These files nicely cover ODK Clan's use case, but at some point different parameters and generally more control over the configs will probably be needed.
it: Questi file soddisfano le esigenze del clan ODK, ma è probabile che ad un certo punto diventino necessari ulteriori parametri e più in generale maggiore controllo sulle configurazioni delle istanze.

source: Custom templates
it: Template personalizzati

source: To enable the use of custom templates make a copy of the template files in the instance's folder and fill in the related fields in the instance's ``config.ini``.
it: Per abilitare l'uso di un template personalizzato copiare i template dentro la cartella dell'istanza server e compilare i relativi campi dentro il file ``config.ini``.

source: Make a copy of ``server_cfg_template.txt``. Fill in the field :option:`config_template <config config_template>`.
it: Creare una copia del file ``server_cfg_template.txt`` e compilare il campo :option:`config_template <config config_template>`.

source: Make a copy of ``run_server_template.txt``. Fill in the field :option:`bat_template <bat bat_template>`.
it: Creare una copia del file ``run_server_template.txt`` e compilare il campo :option:`bat_template <bat bat_template>`.

source: **DO NOT** edit template files directly in the tool folder! Make a copies and link those in the ``config.ini``.
it: **NON MODIFICARE** direttamente i file dei template nella cartella del tool! Creare delle copie e linkare quelle nel file ``config.ini``.

source: The new template files are now going to be used by the tool. Every edit will be carried over to the generated files when creating or updating server instances.
it: I nuovi file di template verranno a questo punto utilizzati dal tool. Ogni modifica verrà riportata nei file generati al momento della creazione o dell'aggiornamento di una istanza server.

source: These templates can be modified to heart's content but don't delete statements like ``{{ hostname }}`` or ``{{ password }}``. These tokens are used by the template framework to fill in fields values set in the ``config.ini`` and they are required. You can move them around though.
it: Questi template possono essere modificati a piacere, ma non devono essere cancellati elementi come ``{{ hostname }}`` o ``{{ password }}``. Questi infatti sono utilizzati dal framework dei template per inserire nei file compilati i valori contenuti nel ``config.ini`` e la loro presenza è quindi obbligatoria, nonostante possano essere spostati nel file a piacimento.

source: Custom templates fields
it: Campi personalizzati in un template

source: It's possible to fill in custom templates directly from the ``config.ini`` file.
it: È possibile compilare dei valori personalizzati in un template direttamente dal file ``config.ini``.

source: Suppose a tweak to the ``maxPlayers`` Arma settings is needed often. Sure, it can be changed directly in the template. But it's also possible to leverage the template framework and edit the template file with a line like this:
it: Ipotizziamo, ad esempio, che sia spesso necessario aggiustare il parametro di Arma ``maxPlayers``. Questo può tranquillamente essere cambiato direttamente nel template. Ma è anche possibile sfruttare il framework che compila i file di template ed inserire lì una riga simile:

source: Now add a new field with the same name in the ``config.ini``, right in the ``[config]`` section. Like this:
it: Ora aggiungere un campo con lo stesso nome nel file ``config.ini``, all'interno della sezione ``[config]``, in questo modo:

source: When the tool is run, the value of the ``max_players`` field in the ``config.ini`` will replace the whole ``{{ max_players }}`` token in the template file, resulting in this:
it: Quando il tool verrà eseguito, il valore del campo ``max_players`` nel file ``config.ini`` andrà a rimpiazzare l'intero elemento ``{{ max_players }}`` nel file di template, risultato in qualcosa di simile:
