Repository: CarloDePieri/odk_servermanager_docs
Catalog: docs/source/locales/*/LC_MESSAGES/usage.po
Languages: it

source: Usage
it: Utilizzo

source: Here you can find detailed instructions on how to create and maintain an ODKSM server instance.
it: Qui è possibile trovare istruzioni dettagliato su come creare e mantenere un'istanza server con ODKSM.

source: First of all make sure the tool is correctly :doc:`installed <installation>`.
it: Prima di tutto assicurarsi che il tool sia correttamente :doc:`installato <installation>`.

source: Create a server instance
it: Creare un'istanza server

source: Begin by filling in the config file ``config.ini`` that can be found in the root directory of the tool.
it: Iniziare compilando il file di configurazione ``config.ini``, che può essere trovato nella cartella principale del tool.

source: It's recommend to never modify files directly in the tool directory: it will be easier to update the tool.
it: È buona norma non modificare mai i file direttamente nella cartella del tool: questo renderà più semplice il processo di aggiornamento.

source: Prepare a custom instance folder and copy the ``config.ini`` and ``ODKSM.bat`` files there; after that, edit ``ODKSM.bat`` and set the variable ``ODKSM_FOLDER_PATH`` to the tool root folder.
it: Preparare una cartella per la nuova istanza server e copiare lì i file ``config.ini`` e ``ODKSM.bat``; dopo aver fatto ciò, editare ``ODKSM.bat`` a impostare la variabile ``ODKSM_FOLDER_PATH`` al percorso completo della cartella principale del tool.

source: The default_ ``config.ini`` is thoroughly documented and all supported fields descriptions can also be found in the :doc:`config.ini documentation <config>`.
it: Il ``config.ini`` di default_ è documentato con cura e tutti i campi supportati sono ulteriormente illustrati nella :doc:`documentazione del config.ini <config>`.

source: Fields in the ``config`` and ``bat`` sections will be used respectively to fill in templates for the ``serverConfig.cfg`` (the file that will be passed with the -config flag to the server) and ``run_server.bat`` (the bat that will be used to launch the instance).
it: I campi delle sezioni ``config`` e ``bat`` verranno usati rispettivamente per compilare i template dei file ``serverConfig.cfg`` (il file che verrà passato al server di Arma con la flag -config) e ``run_server.bat`` (il bat che verrà usato per lanciare l'istanza server).

source: Fields from the ``ODKSM`` section will be used directly by the tool to set paths, mods and keys, amongst other things.
it: I campi della sezione ``ODKSM`` verranno usati direttamente dal tool per impostare percorsi, mod e chiavi, tra le altre cose.

source: User mods can be specified as a list in the config with the :option:`user_mods_list <ODKSM user_mods_list>` field or by passing the path of a mods preset file created by the Arma 3 Launcher in the :option:`user_mods_preset <ODKSM user_mods_preset>` field.
it: I mod utente possono essere specificati come lista nel config con il campo :option:`user_mods_list <ODKSM user_mods_list>` oppure passando il percorso ad un preset mod generato dal launcher di Arma 3 con il campo :option:`user_mods_preset <ODKSM user_mods_preset>`.

source: Server side mods can be specified only as a list with the :option:`server_mods_list <ODKSM server_mods_list>` field.
it: I mod lato server possono essere specificati soltanto come lista con il campo :option:`server_mods_list <ODKSM server_mods_list>`.

source: After editing the config file, simply drag&drop it on the ``ODKSM.bat`` to launch the tool.
it: Dopo aver modificato il file di config, trascinarlo e rilasciarlo sul file ``ODKSM.bat`` per lanciare il tool.

source: Alternatively, in the shell:
it: In alternativa, in una shell:

source: To launch the instance, once its folder has been created run inside it:
it: Per lanciare l'istanza server, una volta che la cartella dell'istanza è stata creata, lanciare al suo interno:

source: Manage a server instance
it: Gestire una istanza server

source: An *update* of a server instance is needed if a change in mission, mods or just a field somewhere is desired. To do so, edit your ``config.ini`` and relaunch ``ODKSM.bat`` via drag&drop or the console.
it: Un *aggiornamento* di una istanza server è necessario quando si desidera cambiare una missione, dei mod oppure semplicemente un parametro in un file di configurazione. Per aggiornare, fare le modifiche necessarie al file ``config.ini`` e rilanciare il tool ``ODKSM.bat`` con un drag&drop oppure dalla console.

source: This will re-link / re-copy mods, reset the keys folder and re-compile config files.
it: Questo forzerà un nuovo link / una nuova copia dei mod, resetterà la cartella delle chiavi e ricompilerà i file di configurazione.

source: When updating mods in the Arma 3 ``!Workshop`` folder the keys files will probably change. Sadly there's no way to magically link them in the instance, since the name of these very files changes. This means that after updating the mods via Steam, an update to the server instance will be needed in order to re-link keys files.
it: Aggiornando i mod nella cartella di Arma 3 ``!Workshop`` i file delle chiavi probabilmente cambieranno. Purtroppo non c'è modo di collegarli magicamente all'istanza, poiché i nomi dei file stessi cambiano. Questo significa che dopo un aggiornamento dei mod da Steam sarà necessario anche un aggiornamento dell'istanza server in modo che il tool possa resettare i link ai file delle chiavi.

source: Remember that when editing **symlinked files** inside a generated instance folder, files **inside the main Arma folder** are really being changed!
it: È fondamentale ricordare che quando si modificano dei **file symlinkati** dentro la cartella dell'istanza server generata dal tool, in realtà vengono cambiati i file **dentro la cartella principale di Arma**.

source: Keep in mind that every **real file** inside the generated instance folder is **re-compiled on update**. This means that any edits, for example to a generated ServerConfig.cfg, will be lost on update. For changes that persist between updates use the main ``config.ini`` file or :doc:`config templates <templates>`.
it: Fare attenzione ai cambiamenti apportati a **file reali** dentro una cartella di istanza server generata dal tool poiché essi vengono **ricompilati ad ogni update**, comportando la perdita di qualsiasi modifica. Per mantenere una personalizzazione tra un update e l'altro, modificare il file principale ``config.ini`` oppure usare i :doc:`template di configurazione <templates>`.

source: Delete a server instance
it: Cancellare una istanza server

source: Everything inside a generated server instance folder are either symlinked or generated by the tool, so the whole folder can be safely deleted if not needed anymore or to start over with a new configuration.
it: Tutto ciò che è contenuto in una cartella di istanza server generata dal tool è un symlink o un file generato dal tool stesso, quindi l'intera cartella può essere cancellata senza problemi se non è più necessaria o se si desidera ricominciare da capo con una nuova configurazione.

source: More customization
it: Ulteriori personalizzazioni

source: This is everything needed to run a server instance! More information about automating some repeating tasks, like setting up several server instances or performing specific action with specific mods, can be found in the :doc:`Advanced Usage section <quick_start>`.
it: Il contenuto di questa pagina è sufficiente per gestire una istanza server! È possibile trovare maggiori informazioni, riguardo l'automatizzazione di alcune operazioni come la creazione di istanze multiple o azioni specifiche per specifici mod, nella :doc:`sezione dedicata all'utilizzo avanzato <quick_start>`.
